app/controllers/home_controller.rb

SELECT "scrapper_results"."updated_at" FROM "scrapper_results" ORDER BY updated_at DESC
SELECT "scrapper_results".* FROM "scrapper_results" ORDER BY "scrapper_results"."id" DESC LIMIT $1  [["LIMIT", 5]]
SELECT "scrapper_results"."updated_at" FROM "scrapper_results" WHERE (brand ILIKE '%Brother%') AND (glosa ILIKE '%DR820 (DR-820) Black Drum Unit%')
---
  def index

    documents = ScrapperResult.last(50).reverse #lista home
    @list = ScrapperResult.last(5).reverse #lista home
    @productos = ScrapperResult.select(:brand, :name)

SELECT "scrapper_results".* FROM "scrapper_results" WHERE "scrapper_results"."id" = $1 ORDER BY "scrapper_results"."id" ASC LIMIT $2  [["id", 282], ["LIMIT", 1]]
---
  def detail
    filter = ScrapperResult.where(id:params[:id])

SELECT "scrapper_results".* FROM "scrapper_results" WHERE (brand = )
SELECT "scrapper_results".* FROM "scrapper_results" WHERE "scrapper_results"."brand" = $1  [["brand", "Brother"]]
SELECT COUNT("scrapper_results"."updated_at") FROM "scrapper_results" WHERE (brand ILIKE '%Brother%')
---
  def show
    fdate = "#{params[:fdate]} 00:00:01"
    ldate = "#{params[:ldate]} 23:59:59"
    documents = ScrapperResult.all
    documents = documents.where("created_at between ?  and ?", fdate, ldate)
    documents = documents.where("name ilike '%#{params[:brand]}%'" )
    @list = documents.paginate(page: params[:page], per_page: 8) #lista buscar