app/controllers/home_controller.rb

  def index
    @site_array = SiteCapture.all.map { |site| [site.name, site.id] }

    @brand = ScrapperResult.select(:brand).distinct { |brand| [brand.name, brand.id] }

    @list = ScrapperResult.last(5).reverse #lista home
    @productos = ScrapperResult.select(:brand, :glosa)
---
SELECT "site_captures".* FROM "site_captures"
SELECT DISTINCT "scrapper_results"."brand" FROM "scrapper_results"
SELECT "scrapper_results"."brand", "scrapper_results"."glosa" FROM "scrapper_results"

  def detail
    filter = ScrapperResult.where(id:params[:id])


    @product = ScrapperResult.where(glosa:filter.first[:glosa], site_captures_id: filter.first[:site_captures_id])
---
SELECT "scrapper_results".* FROM "scrapper_results" WHERE (brand ILIKE '%Brother%') AND "scrapper_results"."site_captures_id" IS NULL AND (glosa ILIKE '%DR620 Drum Cartridge%')

  def show
    logger.debug("-------------------------------------------------------------------------------------------")
    logger.debug(params[:fdate])
    logger.debug(params[:ldate])
    logger.debug(params[:business])
    logger.debug(params[:brand])
    logger.debug("-------------------------------------------------------------------------------------------")

    @list = ScrapperResult.last(20).reverse #lista home
---
SELECT "scrapper_results".* FROM "scrapper_results" ORDER BY "scrapper_results"."id" DESC LIMIT $1  [["LIMIT", 20]]